Repository: wc1c/wc1c
Catalog: assets/languages/wc1c-*.po
Languages: ru_ru

source: Environments
ru_ru: Окружения

source: Data about all current environments.
ru_ru: Данные обо всех текущих окружениях.

source: yes
ru_ru: да

source: not
ru_ru: нет

source: WordPress environment
ru_ru: Окружение WordPress

source: WC1C environment
ru_ru: Окружение WC1C

source: WooCommerce environment
ru_ru: Окружение WooCommerce

source: Server environment
ru_ru: Окружение сервера

source: Home URL
ru_ru: Домашний адрес

source: Site URL
ru_ru: Адрес сайта

source: WordPress version
ru_ru: Версия WordPress

source: WordPress multisite
ru_ru: WordPress мультисайт

source: WordPress debug
ru_ru: Отладка WordPress

source: WordPress language
ru_ru: Язык WordPress

source: WordPress memory limit
ru_ru: Лимит памяти WordPress

source: Server info
ru_ru: Информация сервера

source: PHP version
ru_ru: Версия PHP

source: Database version
ru_ru: Версия СУБД

source: Suhosin
ru_ru: Сухосин

source: Default timezone
ru_ru: Временная зона

source: WC1C version
ru_ru: Версия WC1C

source: Upload directory
ru_ru: Каталог загрузки

source: Count extensions
ru_ru: Количество расширений

source: Count schemas
ru_ru: Количество схем

source: Count tools
ru_ru: Количество иструментов

source: WooCommerce version
ru_ru: Версия WooCommerce

source: WooCommerce product types
ru_ru: Типы продуктов WooCommerce

source: WooCommerce currency
ru_ru: Валюта WooCommerce

source: WooCommerce currency symbol
ru_ru: Символ валюты WooCommerce

source: Undefined
ru_ru: Неопределенный

source: Draft
ru_ru: Черновик

source: Active
ru_ru: Включена

source: Inactive
ru_ru: Отключена

source: Error
ru_ru: Ошибка

source: Processing
ru_ru: В процессе

source: Deleted
ru_ru: Удалена

source: Drafts
ru_ru: Черновики

source: Activated
ru_ru: Включены

source: Deactivated
ru_ru: Отключены

source: With errors
ru_ru: С ошибками

source: In processing
ru_ru: В процессе

source: Trash
ru_ru: Удаленные

source: %s <span class="time">in: %s</span>
ru_ru: %s <span class="time">в: %s</span>

source: Close
ru_ru: Закрыть

# Product Attribute
source: Product %s
ru_ru: Продукт %s

source: Search %s
ru_ru: Найти %s

source: All %s
ru_ru: Все %s

source: Parent %s
ru_ru: Родитель %s

source: Parent %s:
ru_ru: Родитель %s:

source: Edit %s
ru_ru: Редактировать %s

source: Update %s
ru_ru: Обновить %s

source: Add new %s
ru_ru: Добавить новый %s

source: New %s
ru_ru: Новый %s

source: No &quot;%s&quot; found
ru_ru: Не &quot;%s&quot; найден

source: &larr; Back to "%s" attributes
ru_ru: &larr; Вернутся к "%s" атрибутам

source: Could not insert into the database.
ru_ru: Не удалось вставить в базу данных.

source: Invalid attribute.
ru_ru: Недопустимый атрибут.

source: Invalid taxonomy.
ru_ru: Неверная таксономия.

source: Invalid category.
ru_ru: Не валидная категория.

source: Invalid image.
ru_ru: Недопустимое изображение.

source: Back to all configurations
ru_ru: Вернуться ко всем конфигурациям

source: Enter a name for the new configuration, select a scheme, and click the create configuration button.
ru_ru: Введите наименование новой конфигурации, выберите схему и нажмите кнопку создания конфигурации.

source: Each exchange scheme has a unique algorithm of operation and purpose. You need to choose only the scheme you need.
ru_ru: Каждая схема обмена имеет уникальный алгоритм работы и назначение. Вам нужно выбрать только ту схему, которая вам нужна.

source: Create configuration
ru_ru: Создать конфигурацию

source: ID of the configuration to be deleted:
ru_ru: ID удаляемой конфигурации:

source: Name of the configuration to be deleted:
ru_ru: Наименование удаляемой конфигурации:

source: Path of the configuration directory to be deleted:
ru_ru: Путь к удаляемому каталогу конфигурации:

source: Error. Delete is not available
ru_ru: Ошибка. Удаление недоступно

source: Delete
ru_ru: Удалить

source: Configurations by query is not found, query:
ru_ru: Конфигурации по запросу не найдены, запрос:

source: Configurations not found.
ru_ru: Конфигурации не найдены.

source: New configuration
ru_ru: Новая конфигурация

source: Error. Page for configurations not found.
ru_ru: Ошибка. Страница для конфигураций не найдена.

source: Back to configurations list
ru_ru: Вернуться к списку конфигураций

source: Update is not available. Configuration not found or unavailable.
ru_ru: Обновление недоступно. Конфигурация не найдена или недоступна.

source: Save configuration
ru_ru: Сохранить конфигурацию

source: Warning
ru_ru: Предупреждение

source: Update is not available.
ru_ru: Обновление не доступно.

source: Connect by WC1C site
ru_ru: Подключение через сайт WC1C

source: Disconnect
ru_ru: Отключить

source: Connection
ru_ru: Подключение

source: To receive support and official services, need to go through the authorization of external applications.
ru_ru: Для получения поддержки и официальных услуг необходимо пройти авторизацию внешних приложений.

source: Authorization of an external app occurs by going to the official WC1C and returning to the current site.
ru_ru: Авторизация внешнего приложения происходит путем перехода на официальный WC1C и возврата на текущий сайт.

source: Error. Page not found.
ru_ru: Ошибка. Страница не найдена.

source: Extensions not found.
ru_ru: Расширения не найдены.

source: As soon as the extensions are installed, they will appear in this section.
ru_ru: Как только расширения будут установлены, они появятся в этом разделе.

source: Information about all available official extensions is available on the website:
ru_ru: Информация обо всех доступных официальных расширениях размещена на сайте:

source: none
ru_ru: неизвестно

source: ID:
ru_ru: ИД:

source: Version:
ru_ru: Версия:

source: Versions WC1C:
ru_ru: Версии WC1C:

source: from
ru_ru: от

source: to
ru_ru: до

source: First of all, you need to make sure that a bug has been found and that it has not been fixed in updates before.
ru_ru: В первую очередь нужно убедиться, что ошибка найдена и не исправлена ранее в обновлениях.

source: If the bug is fixed in the updates, you just need to install the corrected version.
ru_ru: Если ошибка исправлена в обновлениях, нужно просто установить исправленную версию.

source: Before reporting an error need to check:
ru_ru: Перед сообщением об ошибке необходимо проверить:

source: Whether the settings for WordPress, WooCommerce, WC1C and their extensions are correct.
ru_ru: Верны ли настройки для WordPress, WooCommerce, WC1C и их расширений.

source: Whether compatible versions of WordPress, WooCommerce, WC1C and their extensions are used. Compatibility can be found in the Environments section.
ru_ru: Используются ли совместимые версии WordPress, WooCommerce, WC1C и их расширения. Совместимость можно найти в разделе Environments.

source: If all settings are made correctly and compatible products of the latest versions are used, but the error is still present, you must report it.
ru_ru: Если все настройки выполнены правильно и используются совместимые продукты последних версий, но ошибка все равно присутствует, необходимо сообщить о ней.

source: Report a bug using the methods available to you. When reporting a bug, you must have a valid technical support code for the project on which the bug occurred.
ru_ru: Сообщите об ошибке, используя доступные вам методы. При сообщении об ошибке у вас должен быть действующий код технической поддержки для проекта, в котором возникла ошибка.

source: First of all, you need to make sure - whether the necessary opportunity is really missing.
ru_ru: В первую очередь нужно убедиться – действительно ли отсутствует нужная возможность.

source: It may be worth looking at the available settings or reading the documentation.
ru_ru: Возможно, стоит посмотреть доступные настройки или прочитать документацию.

source: Also, before requesting an opportunity, you need to make sure that:
ru_ru: Кроме того, прежде чем запрашивать возможность, вам необходимо убедиться, что:

source: Is the required feature added in WC1C updates.
ru_ru: Добавлена ли необходимая функция в обновлениях WC1C.

source: Whether the possibility is implemented by an additional extension to WC1C.
ru_ru: Реализована ли возможность дополнительным расширением к WC1C.

source: Whether the desired opportunity is waiting for its implementation.
ru_ru: Ждет ли желанная возможность своего осуществления.

source: If the feature is added in WC1C updates, you just need to install the updated version.
ru_ru: Если функция добавлена в обновлениях WC1C, вам просто нужно установить обновленную версию.

source: But if the feature is implemented in an extension to WC1C, then this feature should not be expected as part of WC1C and you need to install the extension.
ru_ru: Но если функция реализована в расширении к WC1C, то эту функцию не следует ожидать в составе WC1C и необходимо установить расширение.

source: Because the feature implemented in the extension is so significant that it needed to create an extension for it.
ru_ru: Потому что функция, реализованная в расширении, настолько значительна, что для нее нужно было создать расширение.

source: Features
ru_ru: Возможности

source: If no understand how Integration with 1C works, how to use and supplement it, can view the documentation.
ru_ru: Если не понимаете как работает Интеграция с 1С, как ее использовать и дополнять, можете просмотреть документацию.

source: Documentation contains all kinds of resources such as code snippets, user guides and more.
ru_ru: Документация содержит всевозможные ресурсы, такие как фрагменты кода, руководства пользователя и многое другое.

source: Documentation
ru_ru: Документация

source: Error. Page for settings not found.
ru_ru: Ошибка. Страница для настроек не найдена.

source: Save settings
ru_ru: Сохранить настройки

source: Tools not found.
ru_ru: Инструменты не найдены.

source: As soon as the tools are installed, they will appear in this section.
ru_ru: Как только инструменты будут установлены, они появятся в этом разделе.

source: Open
ru_ru: Открыть

source: Error. Step not found or unavailable.
ru_ru: Ошибка. Шаг не найден или не доступен.

source: Step
ru_ru: Шаг

source: Welcome to WC1C!
ru_ru: Добро пожаловать в WC1C!

source: Thank you for choosing WC1C to website! This is only complete solution for integrating WooCommerce with 1C.
ru_ru: Спасибо, что выбрали WC1C для сайта! Это единственное полноценное решение для интеграции WooCommerce с 1С.

source: This quick setup wizard will help you configure the basic settings.
ru_ru: Этот мастер быстрой настройки поможет вам настроить основные параметры.

source: PHP scripts execution time is less than 10 seconds. WC1C requires at least 20. Set php_max_execution_time to more than 20 seconds.
ru_ru: Время выполнения PHP-скриптов менее 10 секунд. WC1C требует как минимум 20. Установите для php_max_execution_time значение более 20 секунд.

source: Its should not take longer than five minutes.
ru_ru: Это не должно занять больше пяти минут.

source: Lets Go!
ru_ru: Погнали!

source: Need to fix the compatibility errors and return to the setup wizard.
ru_ru: Необходимо исправить ошибки совместимости и вернуться к мастеру настройки.

source: Installation completed!
ru_ru: Установка завершена!

source: Now you can proceed to using the WC1C plugin.
ru_ru: Теперь вы можете перейти к использованию плагина WC1C.

source: Go to use
ru_ru: Перейти к использованию

source: Creating tables in the database
ru_ru: Создание таблиц в базе данных

source: If continue, the required tables will be created in the database.
ru_ru: Если продолжить, необходимые таблицы будут созданы в базе данных.

source: Implementation of a mechanism for flexible exchange of various data between 1C products and a site running WordPress using the WooCommerce plugin.
ru_ru: Реализация механизма гибкого обмена различными данными между продуктами 1С и сайтом под управлением WordPress с использованием плагина WooCommerce.

source: WC1C team
ru_ru: Команда WC1C
