Repository: wc1c/wc1c
Catalog: assets/languages/wc1c-*.po
Languages: ru_ru

source: Select all
ru_ru: Выбрать все

source: Select none
ru_ru: Выбрать ничего

source: List View
ru_ru: Просмотр списка

source: Excerpt View
ru_ru: Расширенный просмотр

source: No items found.
ru_ru: Конфигурации не найдены.

source: Select bulk action
ru_ru: Выбрать действие

source: Bulk Actions
ru_ru: Массовое действие

source: Apply
ru_ru: Применить

source: Show more details
ru_ru: Показать больше деталей

source: %s item
ru_ru: %s объект

source: First page
ru_ru: Первая страница

source: Previous page
ru_ru: Предыдущая страница

source: Current Page
ru_ru: Текущая страница

# paging
source: %1$s of %2$s
ru_ru: %1$s из %2$s

source: Next page
ru_ru: Следующая страница

source: Last page
ru_ru: Последняя страница

source: Select All
ru_ru: Выбрать все

source: WC1C successfully activated. You have made the right choice to integrate the site with 1C (plugin number one)!
ru_ru: WC1C успешно активирован. Вы сделали правильный выбор в пользу интеграции сайта с 1С (плагин номер один)!

source: The basic plugin setup has not been done yet, so you can proceed to the setup, which takes no more than 5 minutes.
ru_ru: Базовая настройка плагина еще не сделана, поэтому можно переходить к настройке, которая занимает не более 5 минут.

source: Go to setting.
ru_ru: Перейти к настройке.

source: Integration with 1C
ru_ru: Интеграция с 1С

source: Configurations
ru_ru: Конфигурации

source: Tools
ru_ru: Инструменты

source: Settings
ru_ru: Настройки

source: Extensions
ru_ru: Расширения

source: never
ru_ru: никогда

source: no deadline
ru_ru: вечный

source: to:
ru_ru: до:

source: no support
ru_ru: без поддержки

source: 1C information
ru_ru: Информация 1С

source: Schema ID:
ru_ru: Схема (ID):

source: Configuration ID:
ru_ru: Конфигурация (ID):

source: Not found
ru_ru: Не найдена

source: %s <br/><span class="time">Time: %s</span>
ru_ru: %s <br/><span class="time">Время: %s</span>

source: No activity
ru_ru: Не было

source: Edit
ru_ru: Редактировать

source: Mark as deleted
ru_ru: Пометить на удаление

source: Remove forever
ru_ru: Удалить окончательно

source: User:
ru_ru: Пользователь:

source: User is not exists.
ru_ru: Пользователь не существует.

source: Schema:
ru_ru: Схема:

source: not found, please install the schema
ru_ru: не найдена, пожалуйста установите схему

source: Base information
ru_ru: Базовая информация

source: Status
ru_ru: Состояние

source: Create date
ru_ru: Создана

source: Last activity
ru_ru: Активность

source: All
ru_ru: Все

source: Search
ru_ru: Найти

source: Configuration name
ru_ru: Название конфигурации

source: Enter any data up to 255 characters.
ru_ru: Введите любые данные до 255 символов.

source: Configuration schema
ru_ru: Схема конфигурации

source: Identifier:
ru_ru: Идентификатор:

source: Configuration create error. Please retry.
ru_ru: Конфигурация не создана. Пожалуйста повторите.

source: Configuration create error. Name is required.
ru_ru: Конфигурация не создана. Название конфигурации не заполнено.

source: Configuration create error. Schema is required.
ru_ru: Конфигурация не создана. Не выбрана схема.

source: Configuration create error. Name is exists.
ru_ru: Конфигурация не создана. Конфигурация с таким названием уже существует.

source: Configuration create success. Configuration id:
ru_ru: Конфигурация успешно создана. Идентификатор конфигурации:

source: edit configuration
ru_ru: редактировать конфигурацию

source: Configuration create error. Please retry saving or change fields.
ru_ru: Создание конфигурации не удалось. Пожалуйста повторите процедуру или смените поля.

source: Error. The configuration to be deleted is active and cannot be deleted.
ru_ru: Ошибка. Удаляемая конфигурация активна и не может быть удалена.

source: The configuration has been marked as deleted.
ru_ru: Конфигурация помечена как удаленная.

source: The configuration has been successfully deleted.
ru_ru: Конфигурация успешно удалена.

source: Deleting error. Please retry again.
ru_ru: Ошибка при удалении. Пожалуйста, попробуйте еще раз.

source: Delete confirmation
ru_ru: Подтверждение удаления

source: I confirm that Configuration will be permanently and irrevocably deleted from WooCommerce.
ru_ru: Я подтверждаю, что Конфигурация будет окончательно и безвозвратно удалена из WooCommerce.

source: The directory with files for configuration from the FILE system will be completely removed.
ru_ru: Каталог с файлами для конфигурации из ФАЙЛОВОЙ системы будет полностью удален.

source: Delete error. Please retry.
ru_ru: Ошибка при удалении. Пожалуйста повторите.

source: Delete error. Confirmation of final deletion is required.
ru_ru: Ошибка удаления. Требуется подтверждение окончательного удаления.

source: Configuration update success.
ru_ru: Конфигурация успешно обновлена.

source: Configuration update error. Please retry saving or change fields.
ru_ru: Ошибка обновления конфигурации. Повторите попытку сохранения или изменения полей.

source: About configuration
ru_ru: О конфигурации

source: ID:
ru_ru: ИД:

source: Date create:
ru_ru: Дата создания:

source: Date modify:
ru_ru: Дата изменения:

source: Date active:
ru_ru: Последняя активность:

source: Directory:
ru_ru: Директория:

source: Directory size:
ru_ru: Размер директории:

source: Logs directory size:
ru_ru: Размер директории журналов:

source: About schema
ru_ru: О схеме

source: Main settings
ru_ru: Основные настройки

source: The exchange scheme on the basis of which created configuration is unavailable .
ru_ru: Схема обмена на основании которой создана конфигурация, недоступна.

source: Install the missing schema to work this configuration, change the status and name, or delete the configuration.
ru_ru: Установите отсутствующую схему для работы с этой конфигурацией, измените состояние и имя или удалите конфигурацию.

source: Used for convenient distribution of multiple configurations.
ru_ru: Используется для удобного распределения нескольких конфигураций.

source: Rename
ru_ru: Переименовать

source: Configuration name update success.
ru_ru: Название конфигурации успешно обновлено.

source: Configuration name update error. Please retry saving or change fields.
ru_ru: Ошибка обновления названия конфигурации. Повторите попытку сохранения или изменения полей.

source: Configuration status
ru_ru: Состояние конфигурации

source: Current configuration status.
ru_ru: Текущее состояние конфигурации.

source: Update error. Please retry.
ru_ru: Ошибка при обновлении. Пожалуйста повторите.

source: Fast navigation
ru_ru: Быстрая навигация

source: Help
ru_ru: Помощь

source: Found a bug?
ru_ru: Нашли ошибку?

source: Not a feature?
ru_ru: Нет возможности?

source: Event logs
ru_ru: Журналы событий

source: Interface
ru_ru: Интерфейс

source: Connection to the WC1C
ru_ru: Подключение к WC1C

source: The user with the login %s on the site %s successfully connected to the current site.
ru_ru: Пользователь с логином %s на сайте %s успешно подключен к текущему сайту.

source: Error connecting user with login %s on site %s to the current site. Please try again later.
ru_ru: Ошибка подключения пользователя с логином %s на сайте %s к текущему сайту. Пожалуйста, повторите попытку позже.

source: Connection error. Please retry.
ru_ru: Ошибка подключения. Пожалуйста повторите.

source: Disconnect successful. Reconnect is available
ru_ru: Отключение успешно. Доступно повторное подключение

source: Site is connected to WC1C
ru_ru: Сайт подключен к WC1C

source: To create a new connection, need to disconnect the current connection.
ru_ru: Для создания нового подключения, необходимо отключить текущее.

source: Login
ru_ru: Логин

source: Connected login from the WC1C website.
ru_ru: Подключенный логин с сайта WC1C.

source: App token
ru_ru: Токен приложения

source: The current application token for the user. This token can be revoked in your personal account on the WC1C website, as well as by clicking the Disconnect button.
ru_ru: Текущий токен приложения для пользователя. Этот токен можно отозвать в личном кабинете на сайте WC1C, а также нажав кнопку «Отключить».

source: Save error. Please retry.
ru_ru: Ошибка при сохранении. Пожалуйста повторите.

source: Save success.
ru_ru: Успешное сохранение.

source: Changing the interface
ru_ru: Изменение интерфейса

source: Allow changes to WordPress and WooCommerce dashboard interface?
ru_ru: Разрешить изменения в интерфейсе панели управления WordPress и WooCommerce?

source: If enabled, new features will appear in the WordPress and WooCommerce interface according to the interface change settings.
ru_ru: Если этот параметр включен, новые функции появятся в интерфейсе WordPress и WooCommerce в соответствии с настройками изменения интерфейса.

source: If interface modification is enabled, it is possible to change settings for individual features, users, and roles. If disabled, features will be disabled globally for everyone and everything.
ru_ru: Если модификация интерфейса включена, можно изменить настройки на уровне отдельных функций, пользователей и ролей. Если модификация отключена, функции будут отключены глобально для всех и всего.

source: Some interface settings for the WooCommerce.
ru_ru: Некоторые настройки интерфейса для WooCommerce.

source: Column in products list
ru_ru: Колонка в списке продуктов

source: Enable
ru_ru: Включить

source: Output of a column with information from 1C to the list of products.
ru_ru: Вывод колонки с информацией из 1С в список продуктов.

source: Metabox in edit products
ru_ru: Метабокс в редактировании продуктов

source: Output of a Metabox with information from 1C in edit products.
ru_ru: Вывод метабокса с информацией из 1С в редактирование продуктов.

source: Column in orders list
ru_ru: Колонка в списке заказов

source: Output of a column with information from 1C to the list of orders.
ru_ru: Вывод колонки с информацией из 1С в список заказов.

source: Metabox in edit orders
ru_ru: Метабокс при редактировании заказов

source: Output of a Metabox with information from 1C in edit orders.
ru_ru: Вывод Метабокса с информацией из 1С при редактировании заказов.

source: Column in categories list
ru_ru: Колонка в списке категорий

source: Output of a column with information from 1C to the list of categories.
ru_ru: Вывод колонки с информацией из 1С в список категорий.

source: Some interface settings for the WordPress.
ru_ru: Некоторые настройки интерфейса для WordPress.

source: Column in media library list
ru_ru: Колонка в списке медиатеки

source: Output of a column with information from 1C to the list of media files.
ru_ru: Вывод колонки с информацией из 1С в список медиафайлов.

source: Level for main events
ru_ru: Уровень для основных событий

source: All events of the selected level will be recorded in the log file. The higher the level, the less data is recorded.
ru_ru: Все события выбранного уровня будут записаны в файл журнала. Чем выше уровень, тем меньше записывается данных.

source: DEBUG (100)
ru_ru: Отладка — DEBUG (100)

source: INFO (200)
ru_ru: Информация — INFO (200)

source: NOTICE (250)
ru_ru: Замечание — NOTICE (250)

source: WARNING (300)
ru_ru: Предупреждение — WARNING (300)

source: ERROR (400)
ru_ru: Ошибка — ERROR (400)

source: Maximum files
ru_ru: Максимальное количество файлов

source: Log files created daily. This option on the maximum number of stored files. By default saved of the logs are for the last 30 days.
ru_ru: Файлы журналов создаются ежедневно. Эта опция указывает на максимальное количество хранимых файлов. По умолчанию сохраняются журналы за последние 30 дней.

source: Levels by context
ru_ru: Уровни по контексту

source: Event log settings based on context.
ru_ru: Настройки журнала событий исходя из контекста.

source: Receiver
ru_ru: Получатель

source: All events of the selected level will be recorded the Receiver events in the log file. The higher the level, the less data is recorded.
ru_ru: Все события выбранного уровня будут записаны как события приемника в файл журнала. Чем выше уровень, тем меньше данных записывается.

source: Use level for main events
ru_ru: Использовать уровень для основных событий

source: All events of the selected level will be recorded the tools events in the log file. The higher the level, the less data is recorded.
ru_ru: Все события выбранного уровня будут записываться как события инструментов в файл журнала. Чем выше уровень, тем меньше данных записывается.

source: Schemas
ru_ru: Схемы

source: All events of the selected level will be recorded the schemas events in the log file. The higher the level, the less data is recorded.
ru_ru: Все события выбранного уровня будут записаны как события схемам в файл журнала. Чем выше уровень, тем меньше данных записывается.

source: All events of the selected level will be recorded the configurations events in the log file. The higher the level, the less data is recorded.
ru_ru: Все события выбранного уровня будут записываться как события конфигурации в файл журнала. Чем выше уровень, тем меньше данных записывается.

source: Some settings for the configurations.
ru_ru: Некоторые настройки для конфигураций.

source: Unique names
ru_ru: Уникальные имена

source: Require unique names for configurations?
ru_ru: Требовать уникальные имена для конфигураций?

source: If enabled, will need to provide unique names for the configurations.
ru_ru: Если включено, потребуется предоставить уникальные имена для конфигураций.

source: Number in the list
ru_ru: Количество на одной странице

source: The number of displayed configurations on one page.
ru_ru: Количество отображаемых конфигураций на одной странице.

source: Deleting drafts without trash
ru_ru: Удаление черновиков без пометки на удаление

source: Enable deleting drafts without placing them in the trash?
ru_ru: Разрешить удалять черновики, не помещая их в корзину?

source: If enabled, configurations for connections in the draft status will be deleted without being added to the basket.
ru_ru: Если этот параметр включен, конфигурации для подключений в состоянии черновик будут удаляться без добавления в корзину.

source: Technical settings
ru_ru: Технические настройки

source: Used to set up the environment.
ru_ru: Используется для настройки окружения.

source: Maximum time for execution PHP
ru_ru: Максимальное время выполнения PHP скриптов

source: Value is seconds. WC1C will run until a time limit is set.
ru_ru: Значение в секундах. WC1C будет работать до тех пор, пока не будет достигнуто ограничение по времени.

source: Server value:
ru_ru: Значение сервера:

source: If specify 0, the time limit will be disabled. Specifying 0 is not recommended, it is recommended not to exceed the server limit.
ru_ru: Если указать 0, ограничение по времени будет отключено. Указывать 0 не рекомендуется, рекомендуется не превышать лимит сервера.

source: Maximum request size
ru_ru: Максимальный размер запроса

source: The setting must not take a size larger than specified in the server settings.
ru_ru: Параметр не должен быть больше, чем указано в настройках сервера.

source: Enable data Receiver: background requests?
ru_ru: Включить получателя данных: фоновые запросы?

source: It is used to receive background requests from 1C in exchange schemes. Do not disable this option if you do not know what it is for.
ru_ru: Используется для получения фоновых запросов от 1С в схемах обмена. Не отключайте эту опцию, если не знаете, для чего она нужна.

source: Support
ru_ru: Поддержка

source: If there is no code to support, bug fixes and plugin updates with new features will not be released.
ru_ru: Если нет кода для поддержки, исправления ошибок и обновления плагина с новыми функциями выпускаться не будут.

source: The code can be obtained from the plugin website:
ru_ru: Код можно получить на сайте плагина:

source: Users with active codes participate in the development of integration with 1C, they have a connection with developers and other additional features.
ru_ru: Пользователи с активными кодами участвуют в улучшении интеграции с 1С, у них есть связь с разработчиками и другие дополнительные возможности.

source: Support code activated. To activate another code, you can enter it again.
ru_ru: Код поддержки активирован. Чтобы активировать другой код, можно ввести другой код и активировать.

source: Code for activation
ru_ru: Код для активации

source: If enter the correct code, the current environment will be activated. Enter the code only on the actual workstation.
ru_ru: Если ввести правильный код, текущее окружение будет активировано. Вводите код только на реальном рабочем сервере.

source: Current license API status:
ru_ru: Текущее состояние сервера лицензий:

source: Code ID
ru_ru: Идентификатор кода

source: expires:
ru_ru: истекает:

source: Instance ID
ru_ru: Идентификатор экземпляра

source: Domain
ru_ru: Доменное имя

source: Activate
ru_ru: Активировать

source: The support code is invalid. Enter the correct code.
ru_ru: Код поддержки недействителен. Введите правильный код.

source: Support code activated successfully. Reload the page to display.
ru_ru: Код поддержки успешно активирован. Перезагрузите страницу для отображения.

source: Create tables error. Please retry.
ru_ru: Ошибка создания таблиц. Пожалуйста повторите.

source: Setup wizard
ru_ru: Мастер установки

source: Compatibility
ru_ru: Совместимость

source: Database
ru_ru: База данных

source: Completing
ru_ru: Завершение

source: Timer not loaded.
ru_ru: Таймер не загружен.

source: Extensions not loaded.
ru_ru: Расширения не загружены.

source: Extensions not initialized.
ru_ru: Расширения не инициализированы.

source: Schemas not loaded.
ru_ru: Схемы не загружены.

source: Tools not loaded.
ru_ru: Инструменты не загружены.

source: Tools not initialized.
ru_ru: Инструменты не инициализированы.

source: Receiver not loaded.
ru_ru: Получатель не загружен.

source: This activation code is active.
ru_ru: Этот код активации активен.

source: Error: This activation code has expired.
ru_ru: Ошибка: Срок действия этого кода активации истек.

source: Activation code republished. Awaiting reactivation.
ru_ru: Код активации опубликован повторно. Ожидание повторной активации.

source: Error: This activation code has been suspended.
ru_ru: Ошибка: Этот код активации был приостановлен.

source: This activation code is not found.
ru_ru: Указанный код активации не найден.

source: This activation code is active (localhost).
ru_ru: Этот код активации активен (localhost).

source: Error: This activation code is pending review.
ru_ru: Ошибка: этот код активации ожидает рассмотрения.

source: Error: This version of the software was released after your download access expired. Please downgrade software or contact support for more information.
ru_ru: Ошибка: эта версия программного обеспечения была выпущена после истечения срока вашего доступа к загрузке. Пожалуйста, понизьте версию программного обеспечения или обратитесь в службу поддержки для получения дополнительной информации.

source: Error: The activation code variable is empty.
ru_ru: Ошибка: переменная кода активации пуста.

source: Error: I could not obtain a new local code.
ru_ru: Ошибка: не удалось получить новый локальный код.

source: Error: The maximum local code delay period has expired.
ru_ru: Ошибка: Максимальный период задержки локального кода истек.

source: Error: The local key has been tampered with or is invalid.
ru_ru: Ошибка: локальный код был изменен или недействителен.

source: Error: The local code is invalid for this location.
ru_ru: Ошибка: локальный код недействителен для этого местоположения.

source: Error: Please create the following file (and directories if they dont exist already):
ru_ru: Ошибка: Пожалуйста, создайте следующий файл (и каталоги, если они еще не существуют):

source: Error: Please make the following path writable:
ru_ru: Ошибка: сделайте следующий путь доступным для записи:

source: Error: I could not determine the local key storage on clear.
ru_ru: Ошибка: не удалось определить локальное хранилище ключей при очистке.

source: Error: I could not save the local key.
ru_ru: Ошибка: не удалось сохранить локальный ключ.

source: Error: The local code is invalid for this activation code.
ru_ru: Ошибка: локальный код недействителен для этого кода активации.

source: Error: This activation code has been deleted.
ru_ru: Ошибка: Указанный код активации был удален.

source: Error: This activation code has draft.
ru_ru: Ошибка: код активации в состоянии черновик.

source: Error: This activation code has available.
ru_ru: Ошибка: код активации в состоянии - доступный.

source: Error: This activation code has been blocked.
ru_ru: Ошибка: код активации в состоянии заблокирован.

source: Receiver loading: class is not exists, use is default.
ru_ru: Загрузка получателя: класс не найден, используется класс по умолчанию.

source: Localization loaded.
ru_ru: Локализация загружена.

source: Could not insert into the database
ru_ru: Не удалось вставить в базу данных

source: Meta value by name is not available.
ru_ru: Мета-значение по имени недоступно.

source: Set $extensions is not valid.
ru_ru: Установка $extensions не прошла валидацию.

source: Extension not found by id.
ru_ru: Расширение по идентификатору не найдено.

source: Extension is not implementation ExtensionContract. Skipped init.
ru_ru: Расширение не является реализацией ExtensionContract. Инициализация пропущена.

source: Init extension exception:
ru_ru: Исключение инициализации расширения:

source: Get extension by id is unavailable.
ru_ru: Не удалось получить расширение по его идентификатору.

source: Extensions load exception:
ru_ru: Исключение загрузки расширений:

source: Received new request for Receiver.
ru_ru: Получен новый запрос для Получателя.

source: Receiver request params.
ru_ru: Параметры запроса получателя.

source: Receiver is offline. Request reject.
ru_ru: Получатель выключен. Запрос отклонен.

source: Selected configuration for Receiver is unavailable.
ru_ru: Выбранная для Получателя конфигурация недоступна.

source: Configuration for Receiver is unavailable.
ru_ru: Конфигурация для Получателя недоступна.

source: Selected configuration is offline.
ru_ru: Выбранная конфигурация выключена.

source: Selected configuration is draft.
ru_ru: Выбранная конфигурация является черновиком.

source: Error saving configuration.
ru_ru: Ошибка сохранения конфигурации.

source: Schema for configuration is not initialized.
ru_ru: Схема для конфигурации не инициализирована.

source: The request was successfully submitted for processing in the schema for the selected configuration.
ru_ru: Запрос успешно отправлен на обработку в схему для выбранной конфигурации.

source: Receiver request is very bad! Action not found in selected configuration.
ru_ru: Запрос получателя очень плохой! Действие не найдено в выбранной конфигурации.

source: Receiver request is very bad! Action not found.
ru_ru: Запрос получателя очень плохой! Действие не найдено.

source: $schemas is not valid
ru_ru: $schemas не валидны

source: $configuration is not exists
ru_ru: $configuration не существует

source: $configuration is not instanceof Configuration
ru_ru: $configuration не реализует Configuration

source: $schemas is not array.
ru_ru: $schemas не является массивом.

source: Schema not found by id:
ru_ru: Схема не найдена по ИД:

source: $schemas[$schema_id] is not object
ru_ru: $schemas[$schema_id] не является объектом

source: Old initialized, $schema_id:
ru_ru: Уже инициализирована, $schema_id:

source: Method init not found in schema, $schema_id:
ru_ru: Метод для инициализации не найден в схеме, $schema_id:

source: Schema is not initialized.
ru_ru: Схема не инициализирована.

source: Schema by ID is unavailable.
ru_ru: Схема по идентификатору недоступна.

source: Schemas loaded.
ru_ru: Схема загружена.

source: Schema ProductsCML is not loaded.
ru_ru: Схема ProductsCML не загружена.
