Repository: wc1c/wc1c
Catalog: assets/languages/wc1c-*.po
Languages: ru_ru

source: Newly created products will have selected status. It is recommended to select the status: Draft.
ru_ru: Вновь созданные продукты будут иметь выбранный статус. Рекомендуется выбрать статус: Черновик.

source: The product catalog comes without prices and balances. Publication is best done at the stage of filling in this data.
ru_ru: Каталог продукции поставляется без цен и остатков. Публикацию лучше делать на этапе заполнения этих данных.

source: If a product is marked for deletion in 1C, it will be placed in the trash, regardless of the current setting.
ru_ru: Если товар отмечен на удаление в 1С, он будет помещен в корзину вне зависимости от текущей настройки.

source: The stock status of product created
ru_ru: Статус запаса создаваемого продукта

source: Newly created products will have the selected stock status. It is recommended to select the status: Out of stock.
ru_ru: Вновь созданные продукты будут иметь выбранный статус запаса. Рекомендуется выбрать статус: Нет в наличии.

source: The product catalog comes without quantities. When creating new products, it is better not to expose their availability.
ru_ru: Каталог продукции поставляется без количества. При создании новых продуктов лучше не выставлять напоказ их наличие.

source: Assigning categories of the created product
ru_ru: Присвоение категорий создаваемому продукту

source: Products in 1C have their own hierarchy. Thanks to this hierarchy, it is possible to automatically assign categories to products on the site.
ru_ru: Товары в 1С имеют свою иерархию. Благодаря этой иерархии можно автоматически назначать категории продуктам на сайте.

source: For the correct operation of filling in categories, you must first configure them in a separate settings block.
ru_ru: Для корректной работы заполнения категорий необходимо предварительно настроить их в отдельном блоке настроек.

source: Filling the parent categories of the created product
ru_ru: Заполнение родительских категорий создаваемого продукта

source: If the category assigned to a product is a child category of other categories, then the parent categories will also be assigned to the product being created.
ru_ru: Если категория, назначенная продукту, является дочерней категорией других категорий, то родительские категории также будут присвоены создаваемому продукту.

source: It is recommended to enable this setting.
ru_ru: Рекомендуется включить этот параметр.

source: Assigning attributes of the created product
ru_ru: Присвоение атрибутов создаваемому продукту

source: Newly created products will have attributes added based on the attribute settings. Attribute settings in a separate block.
ru_ru: Вновь созданные продукты будут иметь атрибуты, добавленные на основе настроек атрибутов. Настройки атрибутов в отдельном блоке.

source: Filling the SKU of the created product
ru_ru: Заполнение артикула создаваемого продукта

source: The product SKU will be added according to data from 1C. It is recommended to enable this feature.
ru_ru: Артикул товара будет добавлен согласно данным от 1С. Рекомендуется включить эту функцию.

source: Filling the description of the created product
ru_ru: Заполнение описания создаваемого продукта

source: In the data that came from 1C, there may be descriptions of products that will be placed in a short description.
ru_ru: В данных, которые пришли из 1С, могут быть описания товаров, которые будут размещены в кратком описании.

source: If there are no brief descriptions in 1C, you can turn off the filling and edit the data directly on the site.
ru_ru: Если кратких описаний в 1С нет, можно отключить заполнение и отредактировать данные прямо на сайте.

source: The choice of a source for a brief description in 1C is in a separate settings block - Products (goods): descriptions.
ru_ru: Выбор источника краткого описания в 1С находится в отдельном блоке настроек - Продукты (товары): описания.

source: Filling a full description of the created product
ru_ru: Заполнение полного описания создаваемого продукта

source: The data received from 1C may contain full descriptions of products that will be placed in the full description.
ru_ru: Данные полученные от 1С, могут содержать полные описания товаров, которые будут размещены в полном описании.

source: If there are no brief full descriptions in 1C, you can turn off the filling and edit the data directly on the site.
ru_ru: Если кратких полных описаний в 1С нет, можно отключить заполнение и отредактировать данные прямо на сайте.

source: The choice of a source for a brief full description in 1C is in a separate settings block - Products (goods): descriptions.
ru_ru: Выбор источника для краткого полного описания в 1С находится в отдельном блоке настроек - Продукты (товары): описания.

source: Adding the images of the created product
ru_ru: Добавление изображений к создаваемому продукту

source: Products in 1C can have images. When this setting is enabled, they will be added to newly created products on the site.
ru_ru: Продукты в 1С могут иметь изображения. Когда этот параметр включен, они будут добавляться к вновь созданным товарам на сайте.

source: The choice of a source for a brief images from 1C is in a separate settings block - Products (goods): images.
ru_ru: Выбор источника изображений от 1С находится в отдельном блоке настроек - Продукты (товары): изображения.

source: Featured product
ru_ru: Рекомендуемый продукт

source: The created product will be marked as recommended.
ru_ru: Созданный продукт будет помечен как рекомендованный.

source: Individual sale
ru_ru: Индивидуальная продажа

source: Enable to have the product sold individually in one order. Two units of a product in one order will be impossible to order.
ru_ru: Включите продажу продукта по отдельности в одном заказе. Две единицы товара в одном заказе заказать будет невозможно.

source: Product visibility
ru_ru: Видимость продукта

source: This setting determines which pages products will be displayed on.
ru_ru: Этот параметр определяет, на каких страницах будут отображаться товары.

source: Allow reviews
ru_ru: Разрешить отзывы

source: It will be allowed to leave reviews for created products.
ru_ru: Будет разрешено оставлять отзывы о создаваемых продуктах.

source: Products (goods): updating
ru_ru: Продукты (товары): обновление

source: Regulation of algorithms for updating products in WooCommerce according to 1C data.
ru_ru: Регулирование алгоритмов обновления товаров в WooCommerce по данным 1С.

source: These settings only apply to the updating of old products, ie. those products that are found by the keys for product synchronization.
ru_ru: Эти настройки применимы только к обновлению старых продуктов, т.е. те продукты, которые найдены по ключам для синхронизации продуктов.

source: Consider configuration when requesting product updates
ru_ru: Учитывать конфигурацию при обновлении продуктов

source: When updating products data, the update will only occur if the product was created through the current configuration.
ru_ru: При обновлении данных продуктов обновление произойдет только в том случае, если продукт был создан с помощью текущей конфигурации.

source: Consider schema when requesting product updates
ru_ru: Учитывать схему при обновлении продуктов

source: When updating products data, the update will only occur if the product was created through the current schema.
ru_ru: При обновлении данных продуктов обновление произойдет только в том случае, если продукт был создан с помощью текущей схемы.

source: Do not update
ru_ru: Не обновлять

source: Product status update when requesting product updates
ru_ru: Обновление статуса продукта при запросе обновлений продуктов

source: The selected status will be assigned to all upgraded products when requesting product upgrades.
ru_ru: Выбранный статус будет присвоен всем обновленным продуктам при запросе обновлений продуктов.

source: Product stock status update when requesting product updates
ru_ru: Обновление статуса запасов продукта при запросе обновлений продуктов

source: Upgradable products will change the balance status to the selected option from the list. It is recommended to select the status: Out of stock. Residues in this case will be restored with further processing of the residues.
ru_ru: Обновляемые продукты изменят статус остатка на выбранный вариант из списка. Рекомендуется выбрать статус: Нет в наличии. Остатки в этом случае будут восстановлены с дальнейшей обработкой остатков.

source: Product categories update when requesting product updates
ru_ru: Обновление категорий продукта при запросе обновлений продуктов

source: If the setting is disabled, new categories will not be assigned to old products. Categories can be edited manually and the data will remain unchanged.
ru_ru: Если настройка отключена, новые категории не будут присвоены старым товарам. Категории можно редактировать вручную, и данные останутся неизменными.

source: Product attributes update when requesting product updates
ru_ru: Обновление атрибутов продукта при запросе обновлений продуктов

source: Existing synced products will have their attributes updated based on their attribute settings. Attribute settings in a separate block.
ru_ru: Атрибуты существующих синхронизированных продуктов будут обновлены в соответствии с настройками их атрибутов. Настройки атрибутов в отдельном блоке.

source: Product name update when requesting product updates
ru_ru: Обновление наименования продукта при запросе обновлений продуктов

source: When changing the product name in 1C, the data will be changed on the site.
ru_ru: При смене наименования товара в 1С данные будут изменены на сайте.

source: Product SKU update when requesting product updates
ru_ru: Обновление артикула продукта при запросе обновлений продуктов

source: When changing the product SKU in 1C, the data will be changed on the site.
ru_ru: При смене артикула товара в 1С данные будут изменены на сайте.

source: Product description update when requesting product updates
ru_ru: Обновление описания продукта при запросе обновлений продуктов

source: When changing the product description in 1C, the data will be changed on the site.
ru_ru: При изменении описания товара в 1С данные будут изменены на сайте.

source: Product full description update when requesting product updates
ru_ru: Обновление полного описания продукта при запросе обновлений продуктов

source: When changing the product full description in 1C, the data will be changed on the site.
ru_ru: При изменении полного описания товара в 1С данные будут изменены на сайте.

source: Product images update when requesting product updates
ru_ru: Обновление изображений продукта при запросе обновлений продуктов

source: If the setting is disabled, new images will not be assigned to old products and the old ones will not be deleted either. In this case, you can edit images from WooCommerce.
ru_ru: Если настройка отключена, новые изображения не будут назначаться старым товарам, а старые также не будут удаляться. В этом случае вы можете редактировать изображения из WooCommerce.

source: Filling the parent categories when requesting product updates
ru_ru: Заполнение родительских категорий при запросе обновлений продуктов

source: Check the box if you want to enable this feature. Enabled by default.
ru_ru: Установите флажок, если хотите включить эту функцию. Включено по умолчанию.

source: Fill in the categories that are higher in level for the product? It is recommended to enable this setting.
ru_ru: Заполнить категории, которые выше по уровню для товара? Рекомендуется включить этот параметр.

source: The updated product will be marked as recommended.
ru_ru: Обновляемый продукт будет помечен как рекомендованный.

source: It will be allowed to leave reviews for updated products.
ru_ru: Будет разрешено оставлять отзывы об обновляемых продуктах.

source: Products data exchange via CommerceML
ru_ru: Обмен данными о продуктах через CommerceML

source: Creation and updating of products (goods) in WooCommerce according to data from 1C using the CommerceML protocol of various versions.
ru_ru: Создание и обновление продуктов (товаров) в WooCommerce по данным из 1С с использованием протокола CommerceML различных версий.

source: DecoderCML has been overridden by external algorithms.
ru_ru: DecoderCML был переопределен внешними алгоритмами.

source: ReaderCML has been overridden by external algorithms.
ru_ru: ReaderCML был переопределен внешними алгоритмами.

source: Classifier groups is empty.
ru_ru: Группы классификатора пусты.

source: Classifier group processing.
ru_ru: Обработка группы классификатора.

source: More than one category found by ID from 1C. Assigning the first available.
ru_ru: Более одной категории найдено по ID от 1С. Назначение первой доступной.

source: No category found for the specified name.
ru_ru: Для указанного имени категория не найдена.

source: The category exists. Started updating the data of an existing category.
ru_ru: Категория существует. Начато обновление данных существующей категории.

source: Category update skipped. The category was created from a different configuration.
ru_ru: Обновление категории пропущено. Категория была создана из другой конфигурации.

source: More than one parent category found by ID from 1C. Assigning the first available.
ru_ru: Более одной категории найдено по ID от 1С. Назначение первой доступной.

source: Update of existing category data completed successfully.
ru_ru: Обновление существующих данных категории успешно завершено.

source: The category does not exist. Category creation started.
ru_ru: Категория не существует. Начато создание категории.

source: Category creation completed successfully.
ru_ru: Создание категории успешно завершено.

source: No action was taken for the classifier group.
ru_ru: Для группы классификатора не было предпринято никаких действий.

source: Creating, updating and using categories is disabled.
ru_ru: Создание, обновление и использование категорий отключено.

source: Classifier properties is empty.
ru_ru: Свойства классификатора пусты.

source: Creating attributes based on classifier properties.
ru_ru: Создание атрибутов на основе свойств классификатора.

source: Classifier properties processing.
ru_ru: Обработка свойств классификатора.

source: Attribute search by external algorithms for the classifier property.
ru_ru: Поиск атрибута по внешним алгоритмам для свойства классификатора.

source: An existing attribute was found when searching by external algorithms.
ru_ru: Существующий атрибут был найден при поиске с помощью внешних алгоритмов.

source: Search for an attribute by name for a classifier property.
ru_ru: Поиск атрибута по имени для свойства классификатора.

source: An existing attribute was found when searching by name.
ru_ru: При поиске по имени был найден существующий атрибут.

source: The attribute was not found. Creating.
ru_ru: Атрибут не был найден. Создание.

source: The attribute was not found. Creating disabled.
ru_ru: Атрибут не был найден. Создание отключено.

source: Values for the attribute were found in the classifier properties. Processing.
ru_ru: Значения для атрибута были найдены в свойствах классификатора. Обработка.

source: Adding a value for an attribute.
ru_ru: Добавление значения для атрибута.

source: Failed to add value for attribute.
ru_ru: Не удалось добавить значение для атрибута.

source: Adding values for attributes based on classifier properties is disabled.
ru_ru: Добавление значений для атрибутов на основе свойств классификатора отключено.

source: The creation and updates of attributes based on the classifier properties has been successfully completed.
ru_ru: Создание и обновление атрибутов на основе свойств классификатора успешно завершено.

source: Creating, updating and using attributes is disabled.
ru_ru: Создание, обновление и использование атрибутов отключено.

source: Products creation and updating is disabled. The processing of goods was skipped.
ru_ru: Создание и обновление продуктов отключено. Обработка товаров была пропущена.

source: The use of products with characteristics is disabled. Processing skipped.
ru_ru: Использование продуктов с характеристиками отключено. Обработка пропущена.

source: Failed to set SKU for product.
ru_ru: Ошибка установки артикула для продукта.

source: The maximum possible number of images has been processed. The rest of the images are skip.
ru_ru: Обработано максимально возможное количество изображений. Остальные изображения пропущены.

source: The image assignment for the product is missing. It is not found in the media library.
ru_ru: Отсутствует назначение изображения для продукта. В медиатеке его нет.

source: Assigning attributes for product.
ru_ru: Назначение атрибутов для продукта.

source: Adding attributes to the product is successfully.
ru_ru: Добавление атрибутов к продукту выполнено успешно.

source: Adding default attributes to the variable product is successfully.
ru_ru: Добавление атрибутов по умолчанию к вариативному продукту выполнено успешно.

source: Assigning attributes for variation.
ru_ru: Назначение атрибутов для вариаии.

source: The parent product was not found. Skipped.
ru_ru: Родительский продукт не был найден. Пропуск.

source: The parent product is variation. Skipped.
ru_ru: Родительский продукт - это вариация. Пропуск.

source: Adding attributes to the variation is successfully.
ru_ru: Добавление атрибутов к вариации выполнено успешно.

source: Assigning attributes to a product based on the properties of the product catalog.
ru_ru: Присвоение атрибутов продукту на основе свойств каталога продуктов.

source: Zeroing the characteristics of a variable product.
ru_ru: Обнуление характеристик переменного продукта.

source: Processing of product properties.
ru_ru: Обработка свойств продукта.

source: The attribute has an empty value.
ru_ru: Атрибут имеет пустое значение.

source: The attribute was not found in the classifier properties.
ru_ru: Атрибут не был найден в свойствах классификатора.

source: The attribute contains an empty value identifier.
ru_ru: Атрибут содержит пустой идентификатор значения.

source: Adding values from product properties is disabled and the value is missing from the classifier properties directory. Adding a value is skipped.
ru_ru: Добавление значений из свойств продукта отключено и значение отсутствует в справочнике свойств классификатора. Добавление значения пропущено.

source: Processing of product characteristics.
ru_ru: Обработка характеристик продукта.

source: The characteristic has an empty value.
ru_ru: Характеристика имеет пустое значение.

source: Adding values from product characteristics is disabled and the value is missing in global attributes. Adding a value is skipped.
ru_ru: Добавление значений из характеристик продукта отключено, и это значение отсутствует в глобальных атрибутах. Добавление значения пропущено.

source: Attributes before processing.
ru_ru: Атрибуты перед обработкой.

source: Assigning attributes to a product based on the properties of the offers package.
ru_ru: Присвоение атрибутов продукту на основе свойств пакета предложений.

source: The attribute contains in products characteristics.
ru_ru: Атрибут содержится в характеристиках товаров.

source: Attributes not found. Skipped.
ru_ru: Атрибуты не найдены. Пропуск.

source: Prices processing.
ru_ru: Обработка цен.

source: Prices is not found. Update skipping.
ru_ru: Цены не найдены. Пропуск обновления.

source: Prices before processing.
ru_ru: Цены до обработки.

source: Assign the regular price.
ru_ru: Назначение обычной цены.

source: Assign the sale price.
ru_ru: Назначение цены распродажи.

source: Assign the current price from sale price.
ru_ru: Назначение текущей цены из цены распродажи.

source: Assign the current price from regular price.
ru_ru: Назначение текущей цены из базовой цены.

source: Prices processing is off. Assigning is skip.
ru_ru: Обработка цен отключена. Назначение пропущено.

source: Prices processing is successful.
ru_ru: Обработка цен прошла успешно.

source: Inventories processing.
ru_ru: Обработка запасов.

source: Product inventories update by offers quantity is disabled. Update skipping.
ru_ru: Обновление товарных запасов по количеству предложений отключено. Пропуск обновления.

source: Set inventories by offers quantity: start.
ru_ru: Установка запасов по количеству предложений: начато.

source: Product inventories stored in parent product. Update variation skipping.
ru_ru: Запасы продуктов хранятся в родительском продукте. Пропуск обновления вариации.

source: Inventory management at the product level is disabled. Enabling.
ru_ru: Управление запасами на уровне продукта отключено. Включение.

source: Set inventories by offers quantity: end.
ru_ru: Установка запасов по количеству предложений: завершено.

source: Products create is disabled. Product create skipped.
ru_ru: Функция создания продуктов отключена. Создание продукта пропущено.

source: The use of products delete mark is disabled. Processing skipped.
ru_ru: Использование метки удаления продуктов отключено. Обработка пропущена.

source: The product contains the characteristics.
ru_ru: Продукт содержит характеристики.

source: The product is simple. Create.
ru_ru: Продукт: простой. Создние.

source: The product is created.
ru_ru: Продукт создан.

source: The product has been updated using external algorithms.
ru_ru: Продукт был обновлен с использованием внешних алгоритмов.

source: Products update is disabled. Product update skipped.
ru_ru: Обновление продуктов отключено. Обновление продукта пропущено.

source: The product is created from a different configuration. Update skipped.
ru_ru: Продукт создан на основе другой конфигурации. Обновление пропущено.

source: The product is created from a different schema. Update skipped.
ru_ru: Продукт создан на основе другой схемы. Обновление пропущено.

source: The use of products from trash is disabled. Processing skipped.
ru_ru: Использование продуктов из корзины отключено. Обработка пропущена.

source: Processing an offer from a package of offers.
ru_ru: Обработка предложения из пакета предложений.

source: Product not found. Offer update skipped.
ru_ru: Продукт не найден. Обновление предложения пропущено.

source: Several identical parent of products were found. The first one is selected.
ru_ru: Было найдено несколько идентичных родительских продуктов. Выбран первый из них.

source: Product parent not found. Offer update skipped.
ru_ru: Родительский продукт не найден. Обновление предложения пропущено.

source: Changing the product type to variable.
ru_ru: Изменение типа продукта на вариативный.

source: The parent product was not found. The creation of the variation is skipped.
ru_ru: Родительский продукт не был найден. Создание вариации пропущено.

source: Variation is not found. Creating.
ru_ru: Вариация не найдена. Создание.

source: The creation of the variation is completed.
ru_ru: Создание вариации завершено.

source: An exception was thrown while processing the offer.
ru_ru: При обработке предложения возникло исключение.

source: Cleaning the directory for temporary files.
ru_ru: Очистка каталога от временных файлов.

source: Session for receiving requests is changed by external algorithms.
ru_ru: Сессия для приема запросов изменена внешними алгоритмами.

source: The file was not saved to the media library. Adding is disabled in the settings.
ru_ru: Файл не был сохранен в медиатеке. Добавление отключено в настройках.

source: No name
ru_ru: Без имени

source: The image has not been added to the media library.
ru_ru: Изображение не было добавлено в медиатеку.

source: Image added to media library, id:
ru_ru: Изображение добавлено в медиатеку, идентификатор:

source: The image has not been added to the media library. It was added earlier, id:
ru_ru: Изображение не было добавлено в медиатеку. Оно было добавлено ранее, ИД:
