Repository: wc1c/wc1c
Catalog: assets/languages/wc1c-*.po
Languages: ru_ru

source: Schema ProductsCleanerCML is not loaded.
ru_ru: Схема ProductsCleanerCML не загружена.

source: Receiving requests from 1C
ru_ru: Прием запросов из 1С

source: Authorization of requests and regulation of algorithms for receiving requests for the Receiver from the 1C programs by CommerceML protocol.
ru_ru: Авторизация запросов и регулирование алгоритмов приема запросов для Получателя из программ 1С по протоколу CommerceML.

source: Website address
ru_ru: Адрес сайта

source: Specified in the exchange settings on the 1C side. The Recipient is located at this address, which will receive requests from 1C. When copying, you need to get rid of whitespace characters, if they are present.
ru_ru: Указывается в настройках обмена на стороне 1С. По этому адресу находится Получатель, который будет получать запросы от 1С. При копировании нужно избавиться от пробельных символов, если они присутствуют.

source: Username
ru_ru: Имя пользователя

source: Specified in 1C when setting up an exchange with a site on the 1C side. At the same time, work with data on the site is performed on behalf of the configuration owner, and not on behalf of the specified username.
ru_ru: Указывается в 1С при настройке обмена с сайтом на стороне 1С. При этом работа с данными на сайте производится от имени владельца конфигурации, а не от имени указанного пользователя.

source: User password
ru_ru: Пароль пользователя

source: Specified in 1C paired with a username when setting up an exchange with a site on the 1C side. It is advisable not to specify the password for the current WordPress user.
ru_ru: Указывается в 1С в паре с логином при настройке обмена с сайтом на стороне 1С. Желательно не указывать пароль для текущего пользователя WordPress.

source: Request signature verification
ru_ru: Проверка подписи запросов

source: Check the checkbox to disable request signature verification. By default, validation is performed.
ru_ru: Установите флажок, чтобы отключить проверку подписи запросов. По умолчанию выполняется проверка.

source: The setting disables authentication of requests from 1C. May be required only for very old versions of 1C. Enable only if there are errors in the request signature verification in the logs. If disabled, signature verification will be performed using the lazy signature from the lazysign parameter.
ru_ru: Настройка отключает аутентификацию запросов от 1С. Может потребоваться только для очень старых версий 1С. Включать только при наличии ошибок проверки подписи запросов в логах. Если отключено, проверка подписи будет выполняться с использованием ленивой подписи из параметра lazysign.

source: Other parameters
ru_ru: Прочие параметры

source: Change of data processing behavior for environment compatibility and so on.
ru_ru: Изменение поведения обработки данных для совместимости со средой и так далее.

source: Maximum size of accepted requests
ru_ru: Максимальный размер принимаемых запросов

source: Enter the maximum size of accepted requests from 1C at a time in bytes. May be specified with a dimension suffix, such as 7M, where M = megabyte, K = kilobyte, G - gigabyte.
ru_ru: Введите максимальный размер принимаемых запросов от 1С единовременно в байтах. Может быть указан с суффиксом размера, например 7M, где M = мегабайт, K = килобайт, G - гигабайт.

source: Current WC1C limit:
ru_ru: Текущий лимит WC1C:

source: Can only decrease the value, because it must not exceed the limits from the WC1C settings.
ru_ru: Можно только уменьшить значение, потому что оно не должно выходить за пределы из настроек WC1C.

source: Sync
ru_ru: Синхронизация

source: Dispute resolution between existing products (goods) on the 1C side and in WooCommerce. For extended matching (example by SKU), must use the extension.
ru_ru: Разрешение споров между существующими продуктами (товарами) на стороне 1С и в WooCommerce. Для расширенного сопоставления (например, по SKU) необходимо использовать расширение.

source: Products will only be deleted for found matching keys.
ru_ru: Товары будут удалены только для найденных совпадающих ключей.

source: By external ID from 1C
ru_ru: По внешнему идентификатору от 1С

source: Check the box to enable. Enabled by default.
ru_ru: Установите флажок, чтобы включить. Включено по умолчанию.

source: When creating new products based on data from 1C, a universal global identifier from 1C is filled in for them. Can also fill in global identifiers manually for manually created products.
ru_ru: При создании новых продуктов (товаров) на основе данных из 1С для них заполняется универсальный глобальный идентификатор от 1С. Также можно вручную заполнять глобальные идентификаторы для созданных вручную продуктов.

source: Enabling the option allows you to use the filled External ID to mark products (goods) as existing, and thereby run algorithms to update them.
ru_ru: Включение этой опции позволяет использовать заполненный внешний идентификатор для пометки продуктов (товаров) как существующих и, таким образом, запускать алгоритмы для их обновления.

source: Cleaning
ru_ru: Очистка

source: Comprehensive settings for cleaning options.
ru_ru: Комплексные настройки параметров очистки.

source: Check the box to enable this feature. Disabled by default.
ru_ru: Установите флажок, чтобы включить эту функцию. Отключено по умолчанию.

source: All products received via the CommerceML protocol and matching keys for synchronization will be placed in the Recycle Bin.
ru_ru: Все продукты полученные по протоколу CommerceML и соответствующие ключам для синхронизации будут помещены в Корзину.

source: Final removal
ru_ru: Окончательное удаление

source: All products received via the CommerceML protocol and matching keys for synchronization will be permanently deleted from the Recycle Bin.
ru_ru: Все продукты полученные по протоколу CommerceML и соответствующие по ключам для синхронизации будут безвозвратно удалены из Корзины.

source: Maintaining event logs for the current configuration. You can view the logs through the extension or via FTP.
ru_ru: Ведение журналов событий для текущей конфигурации. Вы можете просматривать журналы через расширение или через FTP.

source: Level for events
ru_ru: Уровень для событий

source: Cleaning of products via CommerceML
ru_ru: Очистка продуктов через CommerceML

source: Cleaning of existing products in WooCommerce according to the nomenclature from 1C via the CommerceML protocol.
ru_ru: Чистка существующих товаров в WooCommerce по номенклатуре от 1С с использованием протокола CommerceML.

source: The file cannot be processed. DecoderCML threw an exception.
ru_ru: Файл не может быть обработан. DecoderCML выдал исключение.

source: The file cannot be processed. ReaderCML threw an exception.
ru_ru: Файл не может быть обработан. ReaderCML выдал исключение.

source: Filetype:
ru_ru: Тип файла:

source: Import file processing not completed. ReaderCML threw an exception.
ru_ru: Обработка файла импорта не завершена. ReaderCML выдал исключение.

source: There was not enough time to load all the data.
ru_ru: Не хватило времени загрузить все данные.

source: Classifier !instanceof ClassifierDataContract. Skip processing.
ru_ru: Классификатор не является экземпляром ClassifierDataContract. Обработка пропущена.

source: An exception was thrown while saving the classifier.
ru_ru: Возникло исключение при сохранении классификатора.

source: Product !instanceof ProductDataContract. Skip processing.
ru_ru: Продукт не является экземпляром ProductDataContract. Обработка пропущена.

source: An exception was thrown while saving the product.
ru_ru: При сохранении продукта возникло исключение.

source: Processing a product from a catalog of products.
ru_ru: Обработка продукта из каталога продуктов.

source: Cleaning of products is disabled. Processing skipped.
ru_ru: Очистка продуктов отключена. Обработка пропущена.

source: Product search result by external code from 1C.
ru_ru: Результат поиска продукта по внешнему коду из 1С.

source: Several identical products were found. The first one is selected.
ru_ru: Было найдено несколько идентичных продуктов. Выбран первый из них.

source: Product search result by external algorithms.
ru_ru: Результат поиска товара с помощью внешних алгоритмов.

source: Product is not found.
ru_ru: Продукт не найден.

source: Received request params.
ru_ru: Полученные параметры запроса.

source: Catalog: mode not found.
ru_ru: Каталог: режим не найден.

source: Schema: action not found.
ru_ru: Схема: действие не найдено.

source: In 1C was send a response of the type:
ru_ru: В 1С был отправлен ответ вида:

source: Headers for response.
ru_ru: Заголовки для ответа.

source: Server in CGI mode. Not detected the presence of an entry in the root .htaccess file on the subject of the contents of the lines.
ru_ru: Сервер в режиме CGI. Не обнаружено наличие записи в корневом файле .htaccess на предмет содержания строк.

source: Not specified the user. Check the server settings.
ru_ru: Не указан пользователь. Проверьте настройки сервера.

source: Not a valid username.
ru_ru: Неверное имя пользователя.

source: Not a valid user password.
ru_ru: Неверный пароль пользователя.

source: PHP session none, start new PHP session.
ru_ru: Сессия PHP отсутствует, начало новой сессии PHP.

source: Request authorization from 1C successfully completed.
ru_ru: Запрос авторизации от 1С успешно выполнен.

source: Print lines for 1C.
ru_ru: Печать строк для 1С.

source: Authorization key verification is disabled. Lazy signature verification activated.
ru_ru: Проверка ключа авторизации отключена. Активирована ленивая проверка подписи.

source: Authorization key verification failed. 1C did not send the name of the lazy signature.
ru_ru: Ошибка проверки ключа авторизации. 1С не отправила имя ленивой подписи.

source: Authorization key verification failed. 1C sent an incorrect lazy signature.
ru_ru: Ошибка проверки ключа авторизации. 1С прислала неверную ленивую подпись.

source: Authorization key verification failed. 1C sent an empty session name.
ru_ru: Ошибка проверки ключа авторизации. 1С прислала пустое имя сеанса.

source: Authorization check failed - session id differs from the original.
ru_ru: Ошибка проверки авторизации - идентификатор сеанса отличается от исходного.

source: Initialization of receiving requests from 1C.
ru_ru: Инициализация приема запросов от 1С.

source: Session for receiving requests.
ru_ru: Сессия для приема запросов.

source: The directory for temporary files was successfully cleared of old files.
ru_ru: Каталог временных файлов успешно очищен от старых файлов.

source: Failed to clear the temp directory of old files.
ru_ru: Не удалось очистить временный каталог от старых файлов.

source: The maximum size of accepted files from 1C is assigned:
ru_ru: Максимальный размер принимаемых файлов от 1С назначается:

source: Based on the global settings of WC1C, the size of received files has been reduced from 1C to:
ru_ru: Исходя из глобальных настроек WC1C, размер получаемых файлов уменьшен с 1С до:

source: Based on the configuration settings of WC1C, the size of received files has been reduced from 1C to:
ru_ru: Исходя из настроек конфигурации WC1C, размер получаемых файлов уменьшен с 1С до:

source: Directory is unavailable:
ru_ru: Каталог недоступен:

source: Filename is empty.
ru_ru: Имя файла пустое.

source: Saving data to a file named:
ru_ru: Сохранение данных в файл с именем:

source: Directory is unavailable for write.
ru_ru: Каталог недоступен для записи.

source: The request contains no data to write to the file. Retry the upload.
ru_ru: Запрос не содержит данных для записи в файл. Повторите загрузку.

source: The file exists. Write a data to the end of an existing file.
ru_ru: Файл существует. Запись данных в конец существующего файла.

source: The data is successfully written to a file. Recorded data size:
ru_ru: Данные успешно записаны в файл. Размер записанных данных:

source: Failed to write data to file.
ru_ru: Не удалось записать данные в файл.

source: On request from 1C - started importing data from a file.
ru_ru: По запросу от 1С - запущен импорт данных из файла.

source: 1C sent an empty file name for data import.
ru_ru: 1С прислала пустое имя файла для импорта данных.

source: File for import is not exists.
ru_ru: Файл для импорта не существует.

source: Import of data from file completed successfully.
ru_ru: Импорт данных из файла успешно завершен.

source: Importing data from a file ended with an error:
ru_ru: Импорт данных из файла завершился ошибкой:

source: Importing data from a file ended with an error.
ru_ru: Импорт данных из файла завершился ошибкой.

source: Specified in the exchange settings on the 1C side. The Recipient is located at this address, which will receive requests from 1C.
ru_ru: Указывается в настройках обмена на стороне 1С. По этому адресу находится Получатель, который будет получать запросы от 1С.

source: When copying, you need to get rid of whitespace characters, if they are present.
ru_ru: При копировании нужно избавиться от пробельных символов, если они присутствуют.

source: Specified when setting up an exchange with a site on the 1C side. Any name can be specified, except for an empty value.
ru_ru: Указывается при настройке обмена с сайтом на стороне 1С. Можно указать любое имя, кроме пустого значения.

source: Work with data on the site is performed on behalf of the configuration owner, and not on behalf of the specified username.
ru_ru: Работа с данными на сайте производится от имени владельца конфигурации, а не от имени указанного пользователя.

source: Specified in pair with the username when setting up on the 1C side. It is advisable not to specify a password for the current WordPress user.
ru_ru: Указывается в паре с логином при настройке на стороне 1С. Желательно не указывать пароль для текущего пользователя WordPress.

source: Categories
ru_ru: Категории

source: Categorization of product positions on the WooCommerce side according to data from 1C.
ru_ru: Категоризация продуктовых (товарных) позиций на стороне WooCommerce по данным от 1С.

source: Do not use
ru_ru: Не использовать

source: Name matching
ru_ru: Соответствие имени

source: Name matching, with the match of the parent category
ru_ru: При совпадении имен, с совпадением родительской категории

source: Using existing categories
ru_ru: Использование существующих категорий

source: In the event that the categories were created manually or from another configuration, you must enable the merge. Merging will avoid duplication of categories.
ru_ru: В том случае, если категории были созданы вручную или из другой конфигурации, необходимо включить слияние. Объединение позволит избежать дублирования категорий.

source: The categories will be linked when the names match without any other data matching.
ru_ru: Категории будут связаны, когда совпадают имена без каких-либо других совпадений данных.

source: The categories will be linked only if they have the same name and parent category.
ru_ru: Категории будут связаны только в том случае, если они имеют одинаковое имя и родительскую категорию.

source: The found categories will be updated according to 1C data according to the update settings. If not want to refresh the data, must enable refresh based on the configuration.
ru_ru: Найденные категории будут обновляться по данным 1С согласно настройкам обновления. Если не хотите обновлять данные связанных категорий, необходимо включить обновление с учетом конфигурации.

source: Creating categories
ru_ru: Создание категорий

source: Check the box if you want to enable this feature. Disabled by default.
ru_ru: Установите флажок, если хотите включить эту функцию. Отключено по умолчанию.

source: Categories are only created if they are recognized as new. New categories are those that are not related according to 1C data and are not in an identical hierarchy.
ru_ru: Категории создаются только в том случае, если они признаны новыми. Новые категории — это те, которые не связаны по данным 1С и не находятся в идентичной иерархии.

source: Updating categories
ru_ru: Обновление категорий

source: If the category created earlier was linked to 1C data, then when you change any category data in 1C, the data will also change in WooCommerce.
ru_ru: Если созданная ранее категория была привязана к данным 1С, то при изменении любых данных категории в 1С данные изменятся и в WooCommerce.

source: Consider configuration when updating categories
ru_ru: Учитывать конфигурацию при обновлении категорий

source: When updating category data, the update will only occur if the category was created through the current configuration.
ru_ru: При обновлении данных категории обновление произойдет только в том случае, если категория была создана с помощью текущей конфигурации.

source: Consider schema when updating categories
ru_ru: Учитывать схему при обновлении категорий

source: When updating category data, the update will only occur if the category was created through the current schema.
ru_ru: При обновлении данных категории обновление произойдет только в том случае, если категория была создана с помощью текущей схемы.

source: Categories: classifier groups
ru_ru: Категории: группы классификатора

source: Create and update categories based on groups from the classifier.
ru_ru: Создание и обновление категорий на основе групп из классификатора.

source: Creating categories from classifier groups
ru_ru: Создание категорий из групп классификатора

source: Categories are only created if they have not been created before. Also, if access to work with categories is allowed from the global settings.
ru_ru: Категории создаются только в том случае, если они не были созданы ранее. Также, если из глобальных настроек разрешен доступ к работе с категориями.

source: Assign parent categories on creating
ru_ru: Назначение родительской категории при создании

source: If there is a parent category in 1C, it will also be assigned in WooCommerce. The setting is triggered when a category is created.
ru_ru: Если в 1С есть родительская категория, она будет присвоена и в WooCommerce. Настройка срабатывает при создании категории.

source: Assign categories description on creating
ru_ru: Назначение описания категорий при создании

source: When creating categories, descriptions will be filled in if category descriptions are present in 1C.
ru_ru: При создании категорий описания будут заполнены, если описания категорий присутствуют в 1С.

source: Updating categories from classifier groups
ru_ru: Обновление категорий из групп классификатора

source: Update parent categories on updating
ru_ru: Обновление родительской категории при обновлении

source: When enabled, parent categories will be updated when they are updated in 1C. The setting is triggered when a category is updated.
ru_ru: При включении родительские категории будут обновляться при их обновлении в 1С. Настройка срабатывает при обновлении категории.

source: Updating categories name
ru_ru: Обновление названия категорий

source: If the category was previously linked to 1C data, then when changing the name in 1C, the name will also change in WooCommerce.
ru_ru: Если категория ранее была привязана к данным 1С, то при смене названия в 1С имя изменится и в WooCommerce.

source: Updating categories description
ru_ru: Обновление описания категорий

source: If the category was previously linked to 1C data, then when you change the description in 1C, the description will also change in WooCommerce. It should be borne in mind that descriptions in 1C are not always stored. Therefore, you should not enable this function if the descriptions were filled out on the site.
ru_ru: Если категория ранее была привязана к данным 1С, то при изменении описания в 1С, описание изменится и в WooCommerce. Следует учитывать, что описания в 1С хранятся не всегда. Поэтому не стоит включать эту функцию, если описания были заполнены на сайте.

source: Products (goods): with characteristics
ru_ru: Продукты (товары): с характеристиками

source: The same product (product) can have various kinds of differences, such as color, size, etc.
ru_ru: Один и тот же продукт (продукт) может иметь различные характеристики, такие как цвет, размер и т.д.

source: In 1C programs, these differences can be presented in the form of characteristics.
ru_ru: В программах 1C эти различия могут быть представлены в форме характеристик.

source: This section of the settings regulates the behavior of the processing of such characteristics on the Woocommerce side.
ru_ru: Этот раздел настроек регулирует поведение обработки таких характеристик на стороне Woocommerce.

source: Using characteristics
ru_ru: Использование характеристик

source: When turning on, products with characteristics will processing on the basis of settings for products.
ru_ru: При включении, продукты с характеристиками будут обрабатываться на основе настроек для продуктов.

source: At the same time, products are divided into simple and variable. Work with simple products will occur when the parent is not found.
ru_ru: В то же время продукты делятся на простые и вариативные. Работа с простыми продуктами будет происходить, когда родительский продукт не найден.

source: The search for the parent product takes place according to a unique identifier of 1C. Search for simple products is carried out in all available settings for synchronization.
ru_ru: Поиск родительского продукта происходит в соответствии с уникальным идентификатором 1C. Поиск простых продуктов выполняется исходя изо всех доступных настроек для синхронизации.

source: With the option disconnected, all the data of products with characteristics will be simply missed. Neither the creation, nor update and no other processing will be.
ru_ru: При отключении опции, все данные продуктов с характеристиками будут просто пропущены. Ни создание, ни обновление и никакая другая обработка не будет.

source: Using global attributes for products
ru_ru: Использование глобальных атрибутов для продуктов

source: It will be allowed to create global attributes and then add values based on product characteristics.
ru_ru: Будет разрешено создавать глобальные атрибуты, а затем добавлять значения на основе характеристик продукта.

source: If the setting is disabled, either existing attributes or attributes at the product level will be used.
ru_ru: Если этот параметр отключен, будут использоваться либо существующие атрибуты, либо атрибуты на уровне продукта.

source: Attributes
ru_ru: Атрибуты

source: General (global) attributes are used for all products.
ru_ru: Общие (глобальные) атрибуты используются для всех продуктов.

source: Work with individual product attributes is configured at the product level.
ru_ru: Работа с отдельными атрибутами продукта настраивается на уровне продукта.

source: These settings only affect the global attributes. As a rule, there is no deletion of global attributes and their values. Removal operations are performed manually or through a cleaner.
ru_ru: Эти настройки влияют только на глобальные атрибуты. Как правило, удаление глобальных атрибутов и их значений не происходит. Операции по удалению выполняются вручную или через очиститель.

source: Creating attributes
ru_ru: Создание атрибутов

source: It will be allowed to add common attributes for products based on characteristics, properties and other data according to the other setting sections.
ru_ru: Будет разрешено добавлять общие атрибуты для продуктов на основе характеристик, свойств и других данных в соответствии с другими разделами настроек.

source: Creation will only occur if the attribute has not been previously created. Verification is possible by: name, identifier from 1C, etc. The default is to match by name.
ru_ru: Создание произойдет только в том случае, если атрибут не был создан ранее. Сопоставление возможно по: имени, идентификатору из 1С и т.д. По умолчанию сопоставление происходит по наименованию.
