Repository: wc1c/wc1c
Catalog: assets/languages/wc1c-*.po
Languages: ru_ru

source: Updating attributes
ru_ru: Обновление атрибутов

source: It will be allowed to update common attributes for products based on characteristics, properties and other data according to the other setting sections.
ru_ru: Будет разрешено обновлять общие атрибуты для продуктов на основе характеристик, свойств и других данных в соответствии с другими разделами настроек.

source: Attribute updating refers to adding product attribute values based on product characteristics, classifier properties, and other data specified in the settings. If you disable this feature, work will only occur with existing attribute values without updating attribute data. In some cases, updating refers to sorting and renaming the attributes themselves.
ru_ru: Под обновлением атрибутов понимается добавление значений атрибутов продуктов на основе характеристик продуктов, свойств классификатора и других данных, указанных в настройках. Если отключить эту функцию, работа будет происходить только с существующими значениями атрибутов без обновления данных атрибутов. В некоторых случаях под обновлением понимается сортировка, и переименование самих атрибутов.

source: Attributes: classifier properties
ru_ru: Атрибуты: свойства классификатора

source: Adding and updating global attributes for products from classifier properties.
ru_ru: Добавление и обновление глобальных атрибутов продуктов (товаров) из свойств классификатора.

source: The properties are contained both in the classifier of the offer package and the product catalog.
ru_ru: Свойства содержатся как в классификаторе пакета предложений, так и в каталоге товаров.

source: Creating attributes from classifier properties
ru_ru: Создание атрибутов из свойств классификатора

source: The creation will occur when processing the properties of the classifier. Creation occurs only if there is no attribute with the specified name or associated identifier.
ru_ru: Создание произойдет при обработке свойств классификатора. Создание происходит только при отсутствии атрибута с указанным именем или ассоциированным идентификатором.

source: If disable the creation of attributes and create some attributes manually, it is possible to adding values to them.
ru_ru: Если отключить создание атрибутов и создать некоторые атрибуты вручную, то можно добавлять к ним значения.

source: Adding values to attributes from classifier properties
ru_ru: Добавление значений к атрибутам из свойств классификатора

source: Adding product attribute values based on classifier property values.
ru_ru: Добавление значений атрибутов продукта на основе значений свойств классификатора.

source: The value is added only if it is absent: by name.
ru_ru: Значение добавляется только в том случае, если оно отсутствует: по имени.

source: Adding values to attributes from product properties
ru_ru: Добавление значений к атрибутам из свойств продукта

source: Classifier properties do not always contain values in the reference. When the setting is enabled, values will be added based on the values of the product properties.
ru_ru: Свойства классификатора не всегда содержат значения в справочнике. Когда этот параметр включен, значения будут добавлены на основе значений свойств продукта.

source: The value is added only if it is missing. If do not add a value, the attribute will be skipped.
ru_ru: Значение добавляется только в том случае, если оно отсутствует. Если не добавлять значение, атрибут будет пропущен.

source: Products (goods): synchronization
ru_ru: Продукты (товары): синхронизация

source: Products not found by sync keys will be treated as new. Accordingly, the rules for creating products will apply to them.
ru_ru: Продукты, не найденные с помощью ключей синхронизации, будут считаться новыми. Соответственно, на них будут распространяться правила создания продуктов.

source: Products (goods)
ru_ru: Продукты (товары)

source: Regulation of algorithms for products. Operations on products are based on data from product catalogs and offer packages described in CommerceML.
ru_ru: Регулирование алгоритмов для продуктов. Операции с товарами основаны на данных из каталогов товаров и пакетов предложений, описанных в CommerceML.

source: Creation of products
ru_ru: Создание продуктов

source: Check the box to enable the creation of new products upon request from 1C. Disabled by default.
ru_ru: Установите флажок, чтобы разрешить создание новых продуктов (товаров) по запросу от 1С. Отключено по умолчанию.

source: The products is only created if it is not found in WooCommerce when searching by criteria for synchronization.
ru_ru: Продукт (товар, услуга) создается только в том случае, если он не найден в WooCommerce при поиске по критериям синхронизации.

source: To create, the products parameters from the current configuration are used.
ru_ru: Для создания используются параметры продуктов из текущей конфигурации.

source: The option works only with automatic creation of products. When disabled, it is still possible to manually create products through ManualCML and similar extensions.
ru_ru: Опция работает только при автоматическом создании товаров. Если этот параметр отключен, по-прежнему можно вручную создавать продукты с помощью ManualCML и подобных расширений.

source: Creation of products: marked for deletion in 1C
ru_ru: Создание продуктов: помеченные на удаление в 1С

source: Check the box to enable this feature. Enabled by default.
ru_ru: Установите флажок, чтобы включить эту функцию. Включено по умолчанию.

source: If the product is marked in 1C for deletion, then when you enable the setting, it will still be created on the site and filled with data.
ru_ru: Если продукт помечен в 1С на удаление, то при включении настройки он все равно будет создан на сайте и заполнен данными.

source: At the same time, it is possible to place such products directly in the trash. There is a separate setting for this.
ru_ru: При этом есть возможность помещать такие продукты прямо в корзину. Для этого есть отдельная настройка.

source: Creation of products: placement of products from 1C marked for deletion to the trash
ru_ru: Создание продуктов: помещение продуктов из 1С помеченных на удаление в корзину

source: If the product is marked in 1C for deletion, then when the setting is enabled, it will be placed in the trash.
ru_ru: Если продукт помечен в 1С на удаление, то при включении настройки он будет помещен в корзину.

source: It is possible to restore the products placed in the basket both manually and using the settings for updating products.
ru_ru: Восстановить продукты, помещенные в корзину можно как вручную, так и с помощью настроек обновления продуктов.

source: Update of products
ru_ru: Обновление продуктов

source: Check the box to enable product updates on demand from 1C. Disabled by default.
ru_ru: Установите флажок, чтобы включить обновление продуктов по запросу от 1С. Отключено по умолчанию.

source: Products are updated only if they were found using the product synchronization keys.
ru_ru: Продукты обновляются только в том случае, если они были найдены с помощью ключей синхронизации продуктов.

source: To update, the products parameters from the current configuration are used.
ru_ru: Для обновления используются параметры продуктов из текущей конфигурации.

source: The option works only with automatic updating of products. When disabled, it is still possible to manually update products through ManualCML and similar extensions.
ru_ru: Опция работает только при автоматическом обновлении товаров. Если этот параметр отключен, по-прежнему можно обновлять продукты вручную с помощью ManualCML и подобных расширений.

source: Update of products: restoring from the trash removed from deletion in 1C
ru_ru: Обновление продуктов: восстановление из корзины снятых с удаления в 1С

source: If the product is not marked in 1C for deletion, and it is in the basket on the site, then when the setting is enabled, it will be returned from the basket and filled with data according to the update settings.
ru_ru: Если продукт не помечен в 1С на удаление, а он имеется в корзине на сайте, то при включении настройки он будет возвращен из корзины и заполнен данными согласно настройкам обновления.

source: If the setting is disabled, all products placed in the basket will be there permanently. It will be impossible to create new products of the same kind.
ru_ru: Если настройка отключена, все продукты помещенные в корзину, останутся там навсегда. Невозможно будет создать новые продукты того же рода.

source: Update of products: placement of products marked for deletion in 1C to the trash
ru_ru: Обновление продуктов: помещение продуктов из 1С помеченных на удаление в корзину

source: It is possible to restore the products placed in the trash both manually and using the settings for updating products.
ru_ru: Восстановить продукты, помещенные в корзину, можно как вручную, так и с помощью настроек обновления товаров.

source: Products (goods): prices
ru_ru: Продукты (товары): цены

source: Comprehensive settings for updating prices.
ru_ru: Комплексные настройки обновления цен.

source: From first found
ru_ru: Из первой найденной

source: From specified name
ru_ru: Из указанного наименования

source: Prices based on CommerceML data: regular
ru_ru: Цены на основе данных CommerceML: обычные

source: The setting works when creating and updating products (goods). The found price after use will not be available for selection as a sale price.
ru_ru: Настройка работает при создании и обновлении продуктов (товаров). Найденная цена после использования не будет доступна для выбора в качестве цены продажи.

source: Populating the regular prices data from CommerceML data will be skipped.
ru_ru: Заполнение данных об обычных ценах из данных CommerceML будет пропущено.

source: The first available price of all available prices for the product will be used as the regular price.
ru_ru: В качестве обычной цены будет использоваться первая доступная цена из всех доступных цен на продукт.

source: The price with the specified name will be used as the regular price. If the price is not found by name, no value will be assigned.
ru_ru: Цена с указанным названием будет использоваться как обычная цена. Если цена не найдена по наименованию, значение присвоено не будет.

source: Prices based on CommerceML data: regular - name in 1C
ru_ru: Цены на основе данных CommerceML: обычные - наименование в 1С

source: Specify the name of the base price in 1C, which is used for filling to WooCommerce as the base price.
ru_ru: Укажите название базовой цены в 1С, которое используется при заливке в WooCommerce в качестве основной цены.

source: Prices based on CommerceML data: sale
ru_ru: Цены на основе данных CommerceML: распродажа

source: The setting works when creating and updating products (goods). The sale price must be less than the regular price. Otherwise, it simply wont apply.
ru_ru: Настройка работает при создании и обновлении продуктов (товаров). Цена распродажи должна быть меньше обычной цены. В противном случае она просто не будет применяться.

source: Populating the sale prices data from CommerceML data will be skipped.
ru_ru: Заполнение данных о ценах распродажи из данных CommerceML будет пропущено.

source: The first available price of all available prices for the product will be used as the sale price.
ru_ru: В качестве цены распродажи будет использоваться первая доступная цена из всех доступных цен на продукт.

source: The price with the specified name will be used as the sale price. If the price is not found by name, no value will be assigned.
ru_ru: Цена с указанным названием будет использоваться как цена распродажи. Если цена не найдена по названию, значение не будет присвоено.

source: Prices based on CommerceML data: sale - name in 1C
ru_ru: Цены на основе данных CommerceML: распродажа - наименование в 1С

source: Specify the name of the sale price in 1C, which is used for filling to WooCommerce as the sale price.
ru_ru: В качестве цены распродажи укажите наименование цены в 1С, которое используется для заполнения в WooCommerce.

source: Products (goods): names
ru_ru: Продукты (товары): наименования

source: Sources and algorithms for filling out product names.
ru_ru: Источники и алгоритмы заполнения наименований продуктов.

source: From the standard name
ru_ru: Из стандартного наименования

source: From the full name
ru_ru: Из полного наименования

source: From requisite with the specified name
ru_ru: Из реквизита с указанным наименованием

source: Names based on CommerceML data
ru_ru: Наименования на основе данных CommerceML

source: The setting works when creating and updating products (goods).
ru_ru: Настройка работает при создании и обновлении продуктов (товаров).

source: Populating the name data from CommerceML data will be skipped. If a product is updating, then its current name will not be updated.
ru_ru: Заполнение данных наименования из данных CommerceML будет пропущено. Если продукт обновляется, то его текущее наименование обновляться не будет.

source: This name is contained in the standard name of 1C products. It is located in the conditional tag - name.
ru_ru: Это наименование содержится в стандартном наименовании продуктов 1С. Оно находится в условном теге — наименование.

source: In 1C it is presented in the form of the Full name of the nomenclature. Unloaded as a requisite with the appropriate name.
ru_ru: В 1С он представлен в виде Полного наименования номенклатуры. Выгружается как реквизит с соответствующим названием.

source: The name data will be filled in based on the completed name of the requisite of the products (goods).
ru_ru: Данные наименования будут заполняться на основании заполненного наименования реквизита продукта (товара).

source: Names based on CommerceML data: name for requisite
ru_ru: Наименования на основе данных CommerceML: наименование реквизита

source: The name of the requisite of the product (goods) which contains a name of the product.
ru_ru: Наименование реквизита продукта (товара), которое содержит наименование продукта.

source: Products (goods): descriptions
ru_ru: Продукты (товары): описания

source: Sources and algorithms for filling out product descriptions, both short descriptions and full descriptions.
ru_ru: Источники и алгоритмы заполнения описаний продуктов, как кратких, так и полных.

source: From the standard description
ru_ru: Из стандартного описания

source: From the HTML description
ru_ru: Из описания в формате HTML

source: Descriptions based on CommerceML data: short
ru_ru: Описания на основе данных CommerceML: краткое

source: Populating the short description data from CommerceML data will be skipped. If a product is updating, then its current short description will not be updated.
ru_ru: Заполнение данных краткого описания из данных CommerceML будет пропущено. Если продукт обновляется, то его текущее краткое описание обновляться не будет.

source: This description is contained in the standard description of 1C products. It is located in the conditional tag - description.
ru_ru: Это описание содержится в стандартном описании продуктов 1С. Он находится в условном теге — описание.

source: Standard description, in HTML format only. Unloaded in a short description if there is a checkmark in 1C - Description in HTML format.
ru_ru: Стандартное описание, только в формате HTML. Выгружается в краткое описание при наличии галочки в 1С - Описание в формате HTML.

source: The short description data will be filled in based on the completed name of the requisite of the products (goods).
ru_ru: Данные краткого описания будут заполняться на основании заполненного наименования реквизита продукта (товара).

source: Descriptions based on CommerceML data: short - name for requisite
ru_ru: Описания на основе данных CommerceML: краткое - наименование реквизита

source: The name of the requisite of the product (goods) which contains a short description of the product.
ru_ru: Наименование реквизита товара (товара), которое содержит краткое описание товара.

source: Descriptions based on CommerceML data: full
ru_ru: Описания на основе данных CommerceML: полное

source: Filling in full description data from CommerceML data will be skipped. If a product is updating, then its current full description will not be updated.
ru_ru: Заполнение данных полного описания из данных CommerceML будет пропущено. Если продукт обновляется, то его текущее полное описание обновляться не будет.

source: Standard description, in HTML format only. It is unloaded when there is a checkmark in 1C - Description in HTML format.
ru_ru: Стандартное описание, только в формате HTML. Выгружается при наличии галочки в 1С - Описание в формате HTML.

source: The full description data will be filled in based on the completed name of the requisite of the products (goods).
ru_ru: Данные полного описания будут заполняться на основании заполненного наименования реквизита продукта (товара).

source: Descriptions based on CommerceML data: full - name for requisite
ru_ru: Описания на основе данных CommerceML: полное - наименование реквизита

source: The name of the requisite of the product (goods) which contains a full description of the product.
ru_ru: Наименование реквизита продукта (товара), которое содержит полное описание продукта.

source: Products (goods): images
ru_ru: Продукты (товары): изображения

source: Regulation of algorithms for working with images of products (goods).
ru_ru: Регулирование алгоритмов работы с изображениями продуктов (товаров).

source: Images based on CommerceML files
ru_ru: Изображения на основе файлов CommerceML

source: When enabled, work with images based on CommerceML files will be allowed.
ru_ru: При включении будет разрешена работа с изображениями на основе файлов CommerceML.

source: Available images in CommerceML files for products will be populated for future use.
ru_ru: Доступные изображения в файлах CommerceML у продуктов будут заполнены для использования в будущем.

source: In this case, the image files themselves must first be added to the WordPress media library. If they are not included, their use will be skipped.
ru_ru: В этом случае сами файлы изображений должны быть предварительно добавлены в медиатеку WordPress. Если они не добавлены, их использование будет пропущено.

source: Images based on CommerceML files: maximum quantity
ru_ru: Изображения на основе файлов CommerceML: максимальное количество

source: The maximum number of images to be processed. The excess number will be ignored. To remove the limit, specify - 0. The limit is necessary for weak systems.
ru_ru: Максимальное количество изображений для обработки. Лишнее количество будет проигнорировано. Для снятия ограничения укажите - 0. Ограничение необходимо для слабых систем.

source: If you specify one image, it will be uploaded as the main one without adding the rest to the product gallery.
ru_ru: Если указать одно изображение, оно будет загружено как основное без добавления остальных в галерею к продуктам (товарам).

source: Media library
ru_ru: Медиа библиотека

source: Regulation of algorithms for working with WordPress media library.
ru_ru: Регулирование алгоритмов работы с медиатекой WordPress.

source: Using the media library
ru_ru: Использование медиа библиотеки

source: All file handling capabilities available to the library will be enabled. If disabled, no actions will be performed on files in the library through the schema.
ru_ru: Будут включены все возможности обработки файлов, доступные для библиотеки. Если этот параметр отключен, никакие действия над файлами в библиотеке через схему выполняться не будут.

source: Images based on Receiver
ru_ru: Изображения на основе файлов Получателя

source: All image files sent to Receiver files will be added to the WordPress media library.
ru_ru: Все файлы изображений, отправленные в виде файлов на Получатель, будут добавлены в медиа библиотеку WordPress.

source: These images can later be used to populate product images.
ru_ru: Эти изображения впоследствии можно использовать для заполнения изображений продуктов.

source: When adding an image, it will be assigned the identifier of the current configuration, as well as the identifier of the scheme and the path of being in 1C.
ru_ru: При добавлении изображения, ему будет присвоен идентификатор текущей конфигурации, а также идентификатор схемы и путь нахождения в 1С.

source: Products (goods): inventories
ru_ru: Продукты (товары): запасы

source: Comprehensive settings for updating inventories based on data from the offer package.
ru_ru: Комплексные настройки обновления запасов на основе данных из пакета предложений.

source: Filling inventories based on quantity from offers
ru_ru: Заполнение запасов на основе количества из предложений

source: It will be allowed to fill in the quantity of product stocks in WooCommerce based on the quantity received in 1C offers.
ru_ru: Будет разрешено заполнить количество продуктовых (товарных) запасов в WooCommerce исходя из количества, полученного в 1С предложениях.

source: Products (goods): dimensions
ru_ru: Продукты (товары): габариты

source: The main settings for filling in the dimensions of products (goods) according to data from 1C. Dimensions include: weight, length, width, height.
ru_ru: Основные настройки заполнения габаритов продуктов (товаров) по данным из 1С. К габаритам относятся: вес, длина, ширина, высота.

source: Filling dimensions based on requisites
ru_ru: Заполнение габаритов по реквизитам

source: Filling in the dimensions will be performed from the given details of the products. For the setting to work, you must specify the correspondence of the details in the fields below.
ru_ru: Заполнение габаритов будет производиться по предоставленным реквизитам продуктов. Для работы настройки необходимо указать соответствие реквизитов в полях ниже.

source: Dimensions based on requisites: weight
ru_ru: Габариты по реквизитам: вес

source: Specify the requisite name of the weight in 1C, which is used for filling to WooCommerce as the weight.
ru_ru: Укажите необходимое название реквизита веса в 1С, которое используется для заполнения в WooCommerce в качестве веса.

source: Weight
ru_ru: Вес

source: Dimensions based on requisites: length
ru_ru: Габариты по реквизитам: длина

source: Specify the requisite name of the length in 1C, which is used for filling to WooCommerce as the length.
ru_ru: Укажите необходимое название реквизита длины в 1С, которое используется для заполнения в WooCommerce в качестве длины.

source: Length
ru_ru: Длина

source: Dimensions based on requisites: width
ru_ru: Габариты по реквизитам: ширина

source: Specify the requisite name of the width in 1C, which is used for filling to WooCommerce as the width.
ru_ru: Укажите необходимое название реквизита ширины в 1С, которое используется для заполнения в WooCommerce в качестве ширины.

source: Width
ru_ru: Ширина

source: Dimensions based on requisites: height
ru_ru: Габариты по реквизитам: высота

source: Specify the requisite name of the height in 1C, which is used for filling to WooCommerce as the height.
ru_ru: Укажите необходимое название реквизита высоты в 1С, которое используется для заполнения в WooCommerce в качестве высоты.

source: Height
ru_ru: Высота

source: Products (goods): creating
ru_ru: Продукты (товары): создание

source: Regulation of algorithms for creating products in WooCommerce according to 1C data.
ru_ru: Регулирование алгоритмов создания товаров в WooCommerce по данным 1С.

source: These settings only apply to the creation of new products, ie. those products that are not found by the keys for product synchronization.
ru_ru: Эти настройки применяются только к созданию новых продуктов, т.е. те продукты, которые не найдены по ключам для синхронизации продуктов.

source: Status of the created product
ru_ru: Статус создаваемого продукта
